CSI API ETABS v1

# eDesignActionType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eDesignActionType

    Public Enumeration eDesignActionType

    Dim instance As eDesignActionType

    public enum class eDesignActionType

    type eDesignActionType

Members

| Member name| Value| Description
---|---|---|---
| NonComposite| 1|
| ShortTermComposite| 2|
| LongTermComposite| 3|
| Staged| 4|
| Other| 5|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com